xs2a-payment-support/xs2a-payment-support-impl/src/test/resources/json/support/mapper/xs2a-bulk-payment.json

{
  "paymentId": "2Cixxv85Or_qoBBh_d7VTZC0M8PwzR5IGzsJuT-jYHNOMR1D7n69vIF46RgFd7Zn_=_bS6p6XvTWI",
  "batchBookingPreferred": true,
  "paymentProduct": "sepa-credit-transfers",
  "debtorAccount": {
    "aspspAccountId": "1234567890",
    "resourceId": "3276159a-27ad-46db-8491-71e629d82baa",
    "currency": "EUR",
    "iban": "DE52500105173911841934",
    "bban": "Test BBAN",
    "maskedPan": "23456xxxxxx1234",
    "msisdn": "0172/1111111",
    "pan": "1111"
  },
  "requestedExecutionDate": "2020-02-02",
  "payments": [
    {
      "paymentId": "2Cixxv85Or_qoBBh_d7VTZC0M8PwzR5IGzsJuT-jYHNOMR1D7n69vIF46RgFd7Zn_=_bS6p6XvTWI",
      "endToEndIdentification": "WBG-123456789",
      "instructedAmount": {
        "amount": "520.00",
        "currency": "EUR"
      },
      "creditorAccount": {
        "currency": "EUR",
        "iban": "DE52500105173911841934",
        "maskedPan": "23456xxxxxx1234",
        "msisdn": "0172/1111111",
        "pan": "1111"
      },
      "creditorAgent": "AAAADEBBXXX",
      "creditorName": "WBG",
      "creditorAddress": {
        "buildingNumber": "56",
        "townName": "Nürnberg",
        "country": {
          "code": "DE"
        },
        "postCode": "90543",
        "streetName": "WBG Straße"
      },
      "remittanceInformationUnstructured": "Ref. Number WBG-1234",
      "ultimateDebtor": "ultimateDebtor",
      "ultimateCreditor": "ultimateCreditor",
      "purposeCode": "CDQC",
      "remittanceInformationStructured": "Ref Number Merchant",
      "transactionStatus": "ACCP",
      "statusChangeTimestamp": "2019-12-27T12:00:00Z"
    }
  ],
  "transactionStatus": "ACCP"
}
